[
  {
    "id": "jd1",
    "department": "Engineering",
    "role": "Senior Frontend Developer",
    "description": "We are seeking an experienced Frontend Developer to join our engineering team. Required skills: 5+ years of experience with React, TypeScript, and modern frontend frameworks. Strong understanding of responsive design, state management (Redux/Context API), and performance optimization. Experience with Next.js, Tailwind CSS, and testing frameworks (Jest, React Testing Library) is highly valued. Must have excellent problem-solving skills and ability to work in an agile environment.",
    "createdDate": "2024-01-10"
  },
  {
    "id": "jd2",
    "department": "Engineering",
    "role": "Full Stack Developer",
    "description": "Looking for a Full Stack Developer with strong backend and frontend experience. Requirements: 3+ years with Node.js, Python, or Go. Proficiency in React or Vue.js. Experience with PostgreSQL, MongoDB, or similar databases. Knowledge of RESTful APIs, GraphQL, Docker, and cloud platforms (AWS/GCP). Familiarity with CI/CD pipelines and microservices architecture is a plus.",
    "createdDate": "2024-01-08"
  },
  {
    "id": "jd3",
    "department": "Engineering",
    "role": "DevOps Engineer",
    "description": "DevOps Engineer to manage and optimize our infrastructure. Required: 4+ years of experience with AWS, Azure, or GCP. Strong knowledge of Kubernetes, Docker, and container orchestration. Expertise in infrastructure as code (Terraform, CloudFormation). Experience with CI/CD tools (Jenkins, GitLab CI, GitHub Actions). Strong scripting skills in Python, Bash, or PowerShell. Understanding of monitoring and logging tools (Prometheus, Grafana, ELK stack).",
    "createdDate": "2024-01-05"
  },
  {
    "id": "jd4",
    "department": "Design",
    "role": "UX Designer",
    "description": "UX Designer to create intuitive and engaging user experiences. Requirements: 4+ years of UX design experience. Proficiency in Figma, Sketch, or Adobe XD. Strong portfolio demonstrating user-centered design process. Experience with user research, wireframing, prototyping, and usability testing. Understanding of accessibility standards (WCAG).",
    "createdDate": "2024-01-12"
  },
  {
    "id": "jd5",
    "department": "Design",
    "role": "UI Designer",
    "description": "Creative UI Designer to craft beautiful and functional interfaces. Required: 3+ years of UI design experience. Expert knowledge of design tools (Figma, Adobe Creative Suite). Strong understanding of typography, color theory, and visual hierarchy. Experience creating and maintaining design systems.",
    "createdDate": "2024-01-15"
  },
  {
    "id": "jd6",
    "department": "Product",
    "role": "Product Manager",
    "description": "Product Manager to drive product strategy and execution. Requirements: 5+ years of product management experience. Strong analytical and data-driven decision-making skills. Experience with agile methodologies and product roadmap planning. Excellent stakeholder management and communication abilities.",
    "createdDate": "2024-01-03"
  },
  {
    "id": "jd7",
    "department": "Product",
    "role": "Product Designer",
    "description": "Product Designer to bridge design and product strategy. Required: 4+ years combining UX/UI design with product thinking. Experience working closely with product managers and engineers. Strong understanding of user research and data analysis.",
    "createdDate": "2024-01-18"
  },
  {
    "id": "jd8",
    "department": "Marketing",
    "role": "Digital Marketing Manager",
    "description": "Digital Marketing Manager to lead our online marketing efforts. Requirements: 5+ years of digital marketing experience. Expertise in SEO, SEM, social media marketing, and email campaigns. Strong analytical skills with Google Analytics, SEMrush, or similar tools.",
    "createdDate": "2024-01-20"
  }
]
